app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def index
    @dogs = Dog.all

INSERT INTO "dogs" ("name", "age", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Virgil"], ["age", "Puppy"], ["description", "German Shepherd mix"], ["created_at", "2015-06-07 00:15:16.303633"], ["updated_at", "2015-06-07 00:15:16.303633"]]
---
  def create
    @dog = Dog.new(dog_params)

    respond_to do |format|
      if @dog.save

UPDATE "dogs" SET "age" = ?, "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["age", "Senior"], ["avatar_file_name", "adult3.jpg"], ["avatar_file_size", 11470], ["avatar_updated_at", "2015-06-10 02:45:42.161390"], ["updated_at", "2015-06-10 02:45:42.351861"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @dog.update(dog_params)

DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 1]]
---
  def destroy
    @dog.destroy

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_dog
      @dog = Dog.find(params[:id])