app/controllers/info_pages_controller.rb

SELECT "info_pages".* FROM "info_pages"
---
  def index
    @info_pages = InfoPage.all